In [1]:
import pandas as pd
import numpy as np
ser1 = pd.Series(np.arange(4)*10)
ser1

0     0
1    10
2    20
3    30
dtype: int32

In [2]:
ser1[1:3]

1    10
2    20
dtype: int32

In [5]:
index=['a','b','c','d']
ser2 = pd.Series(np.arange(4)*10,index)
ser2

a     0
b    10
c    20
d    30
dtype: int32

In [6]:
ser2['b':'d']

b    10
c    20
d    30
dtype: int32

In [7]:
data = np.arange(16).reshape((4,4))
index = ['Ohio', 'Colorado', 'Utah', 'New York']
columns = ['one', 'two', 'three', 'four']
df1 = pd.DataFrame(data, index, columns)
df1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
df1.four # 데이터 프레임 추출

Ohio         3
Colorado     7
Utah        11
New York    15
Name: four, dtype: int32

In [9]:
df1['two'] # 데이터 프레임 추출

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [11]:
df1[['two','four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [12]:
df1[df1['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
df1.loc['Colorado':'Utah',['two','three']]

          two  three
Colorado    5      6
Utah        9     10

In [17]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5],
              index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
              index=['a', 'c', 'e', 'f', 'g'])

In [19]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)),
                  columns = ["a", "b", "c", "d"])
df2 = pd.DataFrame(np.arange(20).reshape((4,5)),
                  columns = ["a", "b", "c", "d", "e"])
print(df1);print(df2)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [20]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [21]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0